{
  "nbformat": 4,
  "nbformat_minor": 0,
  "metadata": {
    "colab": {
      "name": "Доп.задание Python.ipynb",
      "provenance": [],
      "collapsed_sections": []
    },
    "kernelspec": {
      "name": "python3",
      "display_name": "Python 3"
    },
    "language_info": {
      "name": "python"
    }
  },
  "cells": [
    {
      "cell_type": "markdown",
      "source": [
        "1.Напишите программу, которая найдет все такие числа, которые делятся на 7, но не делятся на 5, от 2000 до 3200 (включая оба). Полученные числа должны быть напечатаны в последовательности, разделенной запятыми, в одной строке."
      ],
      "metadata": {
        "id": "GrCgR4eHiHci"
      }
    },
    {
      "cell_type": "code",
      "source": [
        "a = range(2000, 3201)\n",
        "result = []\n",
        "for i in a:\n",
        "  if i % 7 == 0 and i % 5 != 0: \n",
        "    result.append(i)\n",
        "print(\"Полученные числа:\", result)\n",
        "print(\"Количество чисел:\", len(result))   \n",
        "\n"
      ],
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "E8P1ObVbiWcS",
        "outputId": "fd7f72a6-30ff-430a-95fb-245076ce7a03"
      },
      "execution_count": null,
      "outputs": [
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "Полученные числа: [2002, 2009, 2016, 2023, 2037, 2044, 2051, 2058, 2072, 2079, 2086, 2093, 2107, 2114, 2121, 2128, 2142, 2149, 2156, 2163, 2177, 2184, 2191, 2198, 2212, 2219, 2226, 2233, 2247, 2254, 2261, 2268, 2282, 2289, 2296, 2303, 2317, 2324, 2331, 2338, 2352, 2359, 2366, 2373, 2387, 2394, 2401, 2408, 2422, 2429, 2436, 2443, 2457, 2464, 2471, 2478, 2492, 2499, 2506, 2513, 2527, 2534, 2541, 2548, 2562, 2569, 2576, 2583, 2597, 2604, 2611, 2618, 2632, 2639, 2646, 2653, 2667, 2674, 2681, 2688, 2702, 2709, 2716, 2723, 2737, 2744, 2751, 2758, 2772, 2779, 2786, 2793, 2807, 2814, 2821, 2828, 2842, 2849, 2856, 2863, 2877, 2884, 2891, 2898, 2912, 2919, 2926, 2933, 2947, 2954, 2961, 2968, 2982, 2989, 2996, 3003, 3017, 3024, 3031, 3038, 3052, 3059, 3066, 3073, 3087, 3094, 3101, 3108, 3122, 3129, 3136, 3143, 3157, 3164, 3171, 3178, 3192, 3199]\n",
            "Количество чисел: 138\n"
          ]
        }
      ]
    },
    {
      "cell_type": "markdown",
      "source": [
        "2. Напишите программу, которая может вычислить факториалы заданных чисел. Результаты должны быть напечатаны в последовательности, разделенной запятыми, в одной строке."
      ],
      "metadata": {
        "id": "6iihEI7QNx1N"
      }
    },
    {
      "cell_type": "code",
      "source": [
        "numbers = [1, 5, 4, 9, 10, 7]\n",
        "factorial = []\n",
        "for i in numbers:\n",
        "  if i <= 0 or type(i) == float:\n",
        "    print ('Введено некорректное число:',i)\n",
        "  else:\n",
        "    multiply = 1 \n",
        "    for j in range(1, i+1):\n",
        "      multiply = multiply*j\n",
        "    factorial.append(multiply)\n",
        "print(\"Факториалы заданных чисел:\", factorial)"
      ],
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "3Ob1b9jcN14Y",
        "outputId": "e0e920cc-2633-4d52-d10b-ef0151725c2a"
      },
      "execution_count": 127,
      "outputs": [
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "Факториалы заданных чисел: [1, 120, 24, 362880, 3628800, 5040]\n"
          ]
        }
      ]
    },
    {
      "cell_type": "markdown",
      "source": [
        "3.Напишите программу, которая принимает 2 числа X, Y в качестве входных данных с клавиатуры и генерирует двумерный массив. Значение элемента в i-й строке и j-м столбце массива должно быть i*j.  (нумерация с нуля)\n",
        "\n"
      ],
      "metadata": {
        "id": "JPIsNDl9YLVM"
      }
    },
    {
      "cell_type": "code",
      "source": [
        "def martix_fun (x,y): \n",
        "    d1 = []\n",
        "    for i in range (x):\n",
        "      d = []\n",
        "      for j in range (y):\n",
        "        r = i*j\n",
        "        d.append (r)\n",
        "      d1.append(d)\n",
        "    print (*d1, sep=',\\n')\n",
        "\n",
        "print('Укажите размерность матрицы')\n",
        "print('Кол-во строк:')\n",
        "x = int(input())\n",
        "print('Кол-во столбцов:')\n",
        "y = int(input())\n",
        "martix_fun(x,y)"
      ],
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "1fOc5iFyYr9o",
        "outputId": "aeed21d0-3d2b-4422-8c64-093a01460208"
      },
      "execution_count": 86,
      "outputs": [
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "Укажите размерность матрицы\n",
            "Кол-во строк:\n",
            "4\n",
            "Кол-во столбцов:\n",
            "5\n",
            "[0, 0, 0, 0, 0],\n",
            "[0, 1, 2, 3, 4],\n",
            "[0, 2, 4, 6, 8],\n",
            "[0, 3, 6, 9, 12]\n"
          ]
        }
      ]
    },
    {
      "cell_type": "markdown",
      "source": [
        "4.Веб-сайт требует, чтобы пользователи вводили имя пользователя и пароль для регистрации. Напишите программу для проверки правильности ввода пароля пользователями.\n",
        "\n",
        "Ниже приведены критерии проверки пароля:\n",
        "*   Как минимум 1 буква между [a-z]\n",
        "*   По крайней мере, 1 число между [0–9]\n",
        "*   По крайней мере, 1 буква между [A–Z]\n",
        "*   По крайней мере, 1 символ из [$#@]\n",
        "*   Минимальная длина пароля транзакции: 6\n",
        "*   Максимальная длина пароля транзакции: 12\n",
        "\n",
        "\n"
      ],
      "metadata": {
        "id": "W56K5eI60oMR"
      }
    },
    {
      "cell_type": "code",
      "source": [
        "import re\n",
        "def password (w):\n",
        "    if len(w) < 6:\n",
        "      print (\"Ошибка (пароль меньше 6 символов)\")\n",
        "    elif len(w) > 12:\n",
        "      print (\"Ошибка (пароль больше 12 символов)\")\n",
        "    elif not re.search (\"[a-z]\", w):\n",
        "      print (\"Ошибка (пароль не содержит строчные буквы a-z)\")\n",
        "    elif not re.search (\"[0-9]\", w):\n",
        "      print (\"Ошибка (пароль не содержит цифры 0-9)\")\n",
        "    elif not re.search (\"[A-Z]\", w):\n",
        "      print (\"Ошибка (пароль не содержит заглавные буквы A-Z)\")\n",
        "    elif not re.search (\"[$#@]\", w):\n",
        "      print (\"Ошибка (пароль не содержит символы $#@)\")\n",
        "    else:\n",
        "      print ('Пароль подходит')\n",
        "\n",
        "#print('Введите пароль:', \n",
        "w = str(input(\"Введите пароль: \"))\n",
        "print ()\n",
        "print('Результат проверки пароля: ')\n",
        "password (w) "
      ],
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "nRQ76nZ71ccA",
        "outputId": "2a030fb3-d745-40e9-c4d7-6cc085249241"
      },
      "execution_count": 125,
      "outputs": [
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "Введите пароль: Anastasiia3$\n",
            "\n",
            "Результат проверки пароля: \n",
            "Пароль подходит\n"
          ]
        }
      ]
    }
  ]
}